content/command_line_writeup.org
#+Title: How I made a command line chatbot
#+Author: Tyler Burns
#+Date: January 24, 2025 - February 16, 2025

[[./index.html][Home]]

-----
/I went to the woods because I wished to live deliberately, to front only the essential facts of life, and see if I could not learn what it had to teach, and not, when I came to die, discover that I had not lived./

Henry David Thoreau, /Walden/
-----

* Introduction
Since the end of 2022, we have been inundated with LLM chatbots in our everyday lives. The typical use involves some sort of interface that we sign into, where our previous chats can be saved, and so forth. At some point early on, these chatbots were available via API. Here, I want to show how I made a chatbot that can be called from the command line anywhere on my computer.

The use case I'll show you is that of the literate programming environment, which in turn allows you to basically have and store platonic dialogues that are in turn saved and stored. This helps me with specific use cases, like getting feedback on journal entries and notes in real time. A specific example of this involves my German learning, where I often use LLMs to be a conversational partner that provides feedback in real time. Otherwise, in my line of work, I do a lot of research, so I often use LLMs to bounce ideas off of, and so forth. A literate programming environment helps save this feedback directly into the notes I'm taking.

In short, having LLMs available on the command line is useful, and here, I'm going to show you how I do it. The punchline is that it is not particularly hard to do.
* The command line interface
** Chatbot
The first thing we have to do is make a python script where we call an API. At the time of writing [2025-01-27 Mon], Deepseek R1 has just come out, which provides chain-of-thought reasoning (currently state of the art), the likes of GPT-o1 (currently state of the art), but for far cheaper in terms of API calls. Not to mention its open source, so it might be down the line if I get enough computational muscle, I can run it locally.

In terms of calling the API, there are plenty of options, but I use [[https://openrouter.ai/][OpenRouter]]. This gives me access to the GPT models, Claude, Deepseek, and a host of other models. You can browse available models [[https://openrouter.ai/models][here]]. When you sign up, you will get an API key, and the ability to buy credits. To give you an idea of how cheap it is, I put down $5 three days ago (date of this sentence: [2025-01-27 Mon]), and after extensive use primarily of Claude, I have $4.74 remaining.

I wrote a python script called chatbot.py, that takes in as input the desired model to use (currently GPT-4o, Claude, Deepseek R1) and the prompt. It turn prints the answer. The script is as follows:

#+begin_src python :eval no
#!/usr/bin/env python3
from openai import OpenAI
import sys

ds = "deepseek/deepseek-r1"
gpt3 = "openai/gpt-3.5-turbo"
gpt4 = "openai/gpt-4o-2024-11-20"
claude = "anthropic/claude-3.5-sonnet-20240620"

# Ensure the question is passed as a command-line argument
if len(sys.argv) < 3:
    print("Usage: python chatbot.py <model> \"<your question>\"")
    print("Model options: gpt or deepseek")
    sys.exit(1)

# Get the question from the command-line argument
model_choice = sys.argv[1].lower()
user_question = sys.argv[2]

# Map the user's model choice to the appropriate model
if model_choice == "gpt3":
    model = gpt3
elif model_choice == "gpt4":
    model = gpt4
elif model_choice == "deepseek":
    model = ds
elif model_choice == "claude":
    model = claude
else:
    print("Invalid model choice. Please choose either 'gpt' or 'deepseek'.")
    sys.exit(1)


client = OpenAI(
  base_url="https://openrouter.ai/api/v1",
  api_key="YOUR_API_KEY_HERE",
)

completion = client.chat.completions.create(
  model=model,
  messages=[
    {
      "role": "user",
      "content": user_question
    }
  ]
)
print(completion.choices[0].message.content)
#+end_src

This is the first step. You can then run this by going to the directly that this script is in and running:

#+begin_src sh
python chatbot.py "your model here" "your prompt here"
#+end_src

For example:

#+begin_src sh :exports both
python chatbot.py "gpt3" "What is 5 + 2?"
#+end_src

#+RESULTS:
: 5 + 2 = 7

Great. Now the next step is to make this script available anywhere on your computer. The way you do that is to add this script to your PATH. First, I made a directory called scripts that is directly in my PATH.

#+begin_src sh :eval no
mkdir -p ~/scripts
#+end_src

Next, I moved the chatbot python script into that new directory:

#+begin_src sh :eval no
mv chatbot.py ~/scripts/chatbot
chmod +x ~/scripts/chatbot # permissions
#+end_src

Then I place this directory into my PATH, which for me is in ~/.zshrc

#+begin_src sh :eval no
export PATH="$HOME/scripts:$PATH"
#+end_src

Then, I applied the changes with:

#+begin_src sh :eval no
source ~/.zshrc
#+end_src

And from there, I can call chatbot globally by using:

#+begin_src sh :results output :exports both
chatbot "gpt3" "What is 5 + 2?"
#+end_src

#+RESULTS:
: 5 + 2 = 7

In terms of using it on the command line, that is all there is to it. But if you note in the example above, this script ran directly in this writeup, because I am writing this article in a literate programming environment. This one of my preferred ways of using LLMs, as a conversational partner in real time.

Thus, the next section will show you how to get this running in a literate programming environment.
