public/command_line_writeup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>How I made a command line chatbot</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="simple.css" />
</head>
<body>
<div id="preamble" class="status">
<div style="position: fixed; top: 10px; right: 10px;">
         <button class="toggle-theme-btn" onclick="toggleDarkMode()">Light/Dark</button>
       </div>
</div>
<div id="content" class="content">
<h1 class="title">How I made a command line chatbot</h1>
<p>
<a href="./index.html">Home</a>
</p>

<hr />
<p>
<i>I went to the woods because I wished to live deliberately, to front only the essential facts of life, and see if I could not learn what it had to teach, and not, when I came to die, discover that I had not lived.</i>
</p>

<p>
Henry David Thoreau, <i>Walden</i>
</p>
<hr />

<div id="outline-container-orgb840617" class="outline-2">
<h2 id="orgb840617">Introduction</h2>
<div class="outline-text-2" id="text-orgb840617">
<p>
Since the end of 2022, we have been inundated with LLM chatbots in our everyday lives. The typical use involves some sort of interface that we sign into, where our previous chats can be saved, and so forth. At some point early on, these chatbots were available via API. Here, I want to show how I made a chatbot that can be called from the command line anywhere on my computer.
</p>

<p>
The use case I'll show you is that of the literate programming environment, which in turn allows you to basically have and store platonic dialogues that are in turn saved and stored. This helps me with specific use cases, like getting feedback on journal entries and notes in real time. A specific example of this involves my German learning, where I often use LLMs to be a conversational partner that provides feedback in real time. Otherwise, in my line of work, I do a lot of research, so I often use LLMs to bounce ideas off of, and so forth. A literate programming environment helps save this feedback directly into the notes I'm taking.
</p>

<p>
In short, having LLMs available on the command line is useful, and here, I'm going to show you how I do it. The punchline is that it is not particularly hard to do.
</p>
</div>
</div>
<div id="outline-container-org0286963" class="outline-2">
<h2 id="org0286963">The command line interface</h2>
<div class="outline-text-2" id="text-org0286963">
</div>
<div id="outline-container-org4d5ff6b" class="outline-3">
<h3 id="org4d5ff6b">chatbot</h3>
<div class="outline-text-3" id="text-org4d5ff6b">
<p>
The first thing we have to do is make a python script where we call an API. At the time of writing <span class="timestamp-wrapper"><span class="timestamp">[2025-01-27 Mon]</span></span>, Deepseek R1 has just come out, which provides chain-of-thought reasoning (currently state of the art), the likes of GPT-o1 (currently state of the art), but for far cheaper in terms of API calls. Not to mention its open source, so it might be down the line if I get enough computational muscle, I can run it locally.
</p>

<p>
In terms of calling the API, there are plenty of options, but I use <a href="https://openrouter.ai/">OpenRouter</a>. This gives me access to the GPT models, Claude, Deepseek, and a host of other models. You can browse available models <a href="https://openrouter.ai/models">here</a>. When you sign up, you will get an API key, and the ability to buy credits. To give you an idea of how cheap it is, I put down $5 three days ago (date of this sentence: <span class="timestamp-wrapper"><span class="timestamp">[2025-01-27 Mon]</span></span>), and after extensive use primarily of Claude, I have $4.74 remaining.
</p>

<p>
I wrote a python script called chatbot.py, that takes in as input the desired model to use (currently GPT-4o, Claude, Deepseek R1) and the prompt. It turn prints the answer. The script is as follows:
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-comment-delimiter">#</span><span class="org-comment">!/usr/bin/env python3</span>
<span class="org-keyword">from</span> openai <span class="org-keyword">import</span> OpenAI
<span class="org-keyword">import</span> sys

<span class="org-variable-name">ds</span> = <span class="org-string">"deepseek/deepseek-r1"</span>
<span class="org-variable-name">gpt3</span> = <span class="org-string">"openai/gpt-3.5-turbo"</span>
<span class="org-variable-name">gpt4</span> = <span class="org-string">"openai/gpt-4o-2024-11-20"</span>
<span class="org-variable-name">claude</span> = <span class="org-string">"anthropic/claude-3.5-sonnet-20240620"</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Ensure the question is passed as a command-line argument</span>
<span class="org-keyword">if</span> <span class="org-builtin">len</span>(sys.argv) &lt; 3:
    <span class="org-builtin">print</span>(<span class="org-string">"Usage: python chatbot.py &lt;model&gt; \"&lt;your question&gt;\""</span>)
    <span class="org-builtin">print</span>(<span class="org-string">"Model options: gpt or deepseek"</span>)
    sys.<span class="org-constant">exit</span>(1)

<span class="org-comment-delimiter"># </span><span class="org-comment">Get the question from the command-line argument</span>
<span class="org-variable-name">model_choice</span> = sys.argv[1].lower()
<span class="org-variable-name">user_question</span> = sys.argv[2]

<span class="org-comment-delimiter"># </span><span class="org-comment">Map the user's model choice to the appropriate model</span>
<span class="org-keyword">if</span> model_choice == <span class="org-string">"gpt3"</span>:
    model = gpt3
<span class="org-keyword">elif</span> model_choice == <span class="org-string">"gpt4"</span>:
    model = gpt4
<span class="org-keyword">elif</span> model_choice == <span class="org-string">"deepseek"</span>:
    model = ds
<span class="org-keyword">elif</span> model_choice == <span class="org-string">"claude"</span>:
    model = claude
<span class="org-keyword">else</span>:
    <span class="org-builtin">print</span>(<span class="org-string">"Invalid model choice. Please choose either 'gpt' or 'deepseek'."</span>)
    sys.<span class="org-constant">exit</span>(1)


client = OpenAI(
  base_url=<span class="org-string">"https://openrouter.ai/api/v1"</span>,
  api_key=<span class="org-string">"YOUR_API_KEY_HERE"</span>,
)

completion = client.chat.completions.create(
  model=model,
  messages=[
    {
      <span class="org-string">"role"</span>: <span class="org-string">"user"</span>,
      <span class="org-string">"content"</span>: user_question
    }
  ]
)
<span class="org-builtin">print</span>(completion.choices[0].message.content)
</pre>
</div>

<p>
This is the first step. You can then run this by going to the directly that this script is in and running:
</p>

<div class="org-src-container">
<pre class="src src-sh">python chatbot.py <span class="org-string">"your model here"</span> <span class="org-string">"your prompt here"</span>
</pre>
</div>

<p>
For example:
</p>

<div class="org-src-container">
<pre class="src src-sh">python chatbot.py <span class="org-string">"gpt3"</span> <span class="org-string">"What is 5 + 2?"</span>
</pre>
</div>

<pre class="example">
5 + 2 = 7
</pre>


<p>
Great. Now the next step is to make this script available anywhere on your computer. The way you do that is to add this script to your PATH. First, I made a directory called scripts that is directly in my PATH.
</p>

<div class="org-src-container">
<pre class="src src-sh">mkdir -p ~/scripts
</pre>
</div>

<p>
Next, I moved the chatbot python script into that new directory:
</p>

<div class="org-src-container">
<pre class="src src-sh">mv chatbot.py ~/scripts/chatbot
chmod +x ~/scripts/chatbot <span class="org-comment-delimiter"># </span><span class="org-comment">permissions</span>
</pre>
</div>

<p>
Then I place this directory into my PATH, which for me is in ~/.zshrc
</p>

<div class="org-src-container">
<pre class="src src-sh"><span class="org-builtin">export</span> <span class="org-variable-name">PATH</span>=<span class="org-string">"$HOME/scripts:$PATH"</span>
</pre>
</div>

<p>
Then, I applied the changes with:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span class="org-builtin">source</span> ~/.zshrc
</pre>
</div>

<p>
And from there, I can call chatbot globally by using:
</p>

<div class="org-src-container">
<pre class="src src-sh">chatbot <span class="org-string">"gpt3"</span> <span class="org-string">"What is 5 + 2?"</span>
</pre>
</div>

<pre class="example">
5 + 2 = 7
</pre>


<p>
In terms of using it on the command line, that is all there is to it. But if you note in the example above, this script ran directly in this writeup, because I am writing this article in a literate programming environment. This one of my preferred ways of using LLMs, as a conversational partner in real time.
</p>

<p>
Thus, the next section will show you how to get this running in a literate programming environment.
</p>
</div>
</div>
