public/command_line_writeup.html
<div id="outline-container-org29e67ce" class="outline-3">
<h3 id="org29e67ce">searchbot</h3>
<div class="outline-text-3" id="text-org29e67ce">
<p>
If we are querying a LLM, we are often at the mercy of the cutoff of the given LLM's training data. At the time of writing <span class="timestamp-wrapper"><span class="timestamp">[2025-02-16 Sun]</span></span>, ChatGPT (as an example) has the option of incorporating internet search in a given query. However, calling LLMs from an API, as per the previous section, does not mean that you get an internet search baked in.
</p>

<p>
To this end, I created searchbot. Using the same concept as "chatbot" in the previous section, I wrote a script that queries the API to perplexity. This tool was one of the first LLMs that integrated these models with an internet search. If you want to have "searchbot" in your command line, first go to <a href="https://docs.perplexity.ai/api-reference/chat-completions">perplexity</a> and get an API key. Then, please create a script called searchbot.py which has the following code pasted into it:
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-comment-delimiter">#</span><span class="org-comment">!/usr/bin/env python3</span>
<span class="org-keyword">import</span> sys
<span class="org-keyword">from</span> openai <span class="org-keyword">import</span> OpenAI

<span class="org-keyword">if</span> <span class="org-builtin">len</span>(sys.argv) &lt; 2:
    <span class="org-builtin">print</span>(<span class="org-string">"searchbot \"your_prompt\""</span>)
    sys.<span class="org-constant">exit</span>(1)

<span class="org-variable-name">user_query</span> = <span class="org-string">" "</span>.join(sys.argv[1:])

<span class="org-variable-name">YOUR_API_KEY</span> = <span class="org-string">"YOUR_API_KEY_HERE"</span>

<span class="org-variable-name">messages</span> = [
    {
        <span class="org-string">"role"</span>: <span class="org-string">"system"</span>,
        <span class="org-string">"content"</span>: (
            <span class="org-string">"You are an artificial intelligence assistant and you need to "</span>
            <span class="org-string">"engage in a helpful, detailed, polite conversation with a user."</span>
        ),
    },
    {
        <span class="org-string">"role"</span>: <span class="org-string">"user"</span>,
        <span class="org-string">"content"</span>: user_query,
    },
]

<span class="org-variable-name">client</span> = OpenAI(api_key=YOUR_API_KEY, base_url=<span class="org-string">"https://api.perplexity.ai"</span>)

<span class="org-comment-delimiter"># </span><span class="org-comment">chat completion without streaming</span>
response = client.chat.completions.create(
    model=<span class="org-string">"sonar-pro"</span>,
    messages=messages,
)
<span class="org-builtin">print</span>(response)
</pre>
</div>

<p>
In the above script, please add your api key to the variable YOUR<sub>API</sub><sub>KEY</sub>.
</p>

<p>
From here, you do the same procedure as before. You get this script into your PATH. Here is how I do it on my 2022 MacBook Pro:
</p>

<div class="org-src-container">
<pre class="src src-sh">mv searchbot.py ~/scripts/searchbot
chmod +x ~/scripts/searchbot <span class="org-comment-delimiter"># </span><span class="org-comment">permissions</span>
</pre>
</div>

<p>
Then once again I apply the changes with:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span class="org-builtin">source</span> ~/.zshrc
</pre>
</div>

<p>
And from here, I can call searchbot globally, like this:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span class="org-builtin">source</span> ~/.zshrc
searchbot <span class="org-string">"What is the latest news around Open AI's potential release of GPT-5?"</span>
</pre>
</div>

<p>
You can see that it is a bit of a mess right now because I have the bot return everything. As of now, I use these search results to feed back into the chatbots to produce reports. I'll explain in the next section.
</p>
</div>
</div>
</div>
