content/command_line_writeup.org
* Prompt scripting: the next level of prompt engineering
Now that we are able to call chatbot and searchbot from the command line, we now have to talk about what is possible that otherwise cannot be done in the LLM UI/UX. Here is where knowing how to code (as opposed to knowing how to prompt LLMs to code) really comes in handy. Because to understand the next level of prompt engineering, you need to be able to think algorithmically.

What we can do now is what I call prompt scripting. This is where you write scripts (in whatever programming language) where the data structures are LLM agents, rather than just strings and ints, for example. In order to help you understand what I'm talking about, I'm going to go right into a simple example.

Below, we are going to use searchbot and chatbot in a simple manner. We are going to produce a prompt for searchbot. We are then going to feed the searchbot results and the original prompt directly into chatbot, which will then produce a report.

#+begin_src sh :results output :exports both
source ~/.zshrc

news=$(searchbot "Please give me the lastest news around LLM developments. Focus on things that have happened as of February 1, 2025 and after. Use the most reputable sources possible.")
newsletter=$(chatbot "deepseek" "You are to produce a newsletter given the latest updates around LLM developments as of February 1, 2025. A researcher, perplexity, has compiled notes for you to use. You will take these as input and produce the newsletter. Make it academic in style. Include citations as you would an academic journal, both in the report with footnotes along with a citations section. Begin with an abstract that summarizes these developments. The research notes you will use, along with sources, is here: $news")

echo "$newsletter"
#+end_src

#+RESULTS:
#+begin_example
,**LLM Research Bulletin: February 2025 Advancements**
,**Volume 3, Issue 1**

---

### Abstract
Recent advancements in large language models (LLMs) underscore rapid progress in computational efficiency, domain specialization, and multilingual capabilities. This bulletin examines four pivotal releases: DeepSeek R1 (January 2025), Rakuten AI 2.0 and 2.0 mini (February 2025), Qwen2.5-Max (January 2025), and EXAONE 3.0 (December 2024). These models emphasize parameter efficiency, cost-effective training, and task-specific optimization, with notable applications in mathematics, coding, cross-lingual generation, and edge-device deployment. Innovations include hybrid architectures like mixture-of-experts (MoE), reduced inference costs, and open-source availability, reflecting broader industry trends toward scalable, domain-adaptive AI systems[1,5,9].

---

### Introduction
The first quarter of 2025 has witnessed significant strides in LLM development, driven by demand for specialized performance and operational efficiency. Key themes include competitive benchmarking in STEM tasks, multilingual model diversification, and hardware-optimized deployment. This bulletin synthesizes technical specifications, benchmark outcomes, and strategic implications of four leading models, contextualized within the evolving LLM research landscape.

---

### Model Overviews

#### **DeepSeek R1**
Released in January 2025, DeepSeek R1 combines a 671-billion-parameter total architecture with 37 billion active parameters per inference, leveraging dynamic sparse activation[1]. The model achieves state-of-the-art performance on MATH-500 (85.3% accuracy) and AIME 2024 (72.1%), surpassing equivalent OpenAI models in arithmetic reasoning and code synthesis[1]. Notably, its training cost—reported at $8.2 million—represents a 40% reduction compared to similarly sized predecessors[1]. Open-source availability under the Apache-2.0 license has accelerated community-driven fine-tuning efforts, particularly in educational applications[4].

#### **Rakuten AI 2.0 Series**
Rakuten AI 2.0, launched February 12, 2025, is Japan’s first MoE-style LLM, integrating eight 7-billion-parameter expert networks[5]. Specialized for low-resource language processing, it achieves a 3.8% perplexity reduction over GPT-4 Turbo in Japanese-to-English translation tasks[5]. The companion model, Rakuten AI 2.0 mini (1.5B dense parameters), targets edge-device deployment, sustaining 30 tokens/second on consumer-grade GPUs while retaining 92% of 2.0’s accuracy in summarization benchmarks[5].

#### **Alibaba Qwen2.5-Max**
Qwen2.5-Max (January 2025) focuses on latency-sensitive applications, excelling in GPQA-Diamond (89.7%) and LiveCodeBench (94.3%)[9]. Though parameter counts remain undisclosed, Alibaba reports a 55% inference speed improvement over Qwen2.0, attributed to tensor parallelism optimizations[9]. Industry adopters highlight its utility in real-time fraud detection and high-frequency trading systems, where sub-200ms response times are critical[9].

#### **LG EXAONE 3.0**
Debuting in December 2024, EXAONE 3.0 (7.8B parameters) supports Korean and English, specializing in technical domains like patent analysis and chemical synthesis[9]. Its “layer pruning” algorithm reduces memory usage by 44% during inference, enabling cost-effective deployment in industrial R&D pipelines[9]. Benchmark results include a 91.5% F1 score on organic reaction prediction (USPTO-2023) and 83.4% accuracy on semiconductor patent prior-art retrieval[9].

---

### Comparative Analysis
1. **Architectural Trends**: MoE adoption (e.g., Rakuten AI 2.0) highlights trade-offs between computational cost and task specificity, whereas dense models (Qwen2.5-Max) prioritize determinism for latency-critical use cases[5,9].
2. **Efficiency Metrics**: Collective emphasis on reducing training/inference costs—seen in DeepSeek’s sparse activation and EXAONE’s layer pruning—reflects industry prioritization of ROI over sheer parameter scale[1,9].
3. **Edge Deployment**: Rakuten AI 2.0 mini and Qwen2.5-Max signal growing investment in decentralized AI, circumventing cloud dependency for privacy-sensitive applications[5,9].

---

### Future Directions
1. **Dynamic MoE Routing**: Improving expert-network selection via reinforcement learning.
2. **Cross-Modal Integration**: Expanding LLM utility through unified text-code-molecule frameworks (e.g., EXAONE’s chemistry extensions).
3. **Regulatory Adaptation**: Addressing compliance challenges as open-source models (DeepSeek R1) proliferate in sensitive sectors[1,2].

---

### Conclusion
2025’s early LLM advancements reveal a maturation focus: optimizing existing paradigms rather than scaling parameters. Innovations in efficiency, language/code specialization, and decentralized deployment are poised to drive commercial adoption across education, finance, and R&D sectors.

---

### Citations
1. “Top Emerging Large Language Models (LLMs) 2025,” *Exploding Topics*, 2025. Available: https://explodingtopics.com/blog/list-of-llms
5. “Rakuten AI 2.0 Release Announcement,” *Rakuten Group Press Release*, Feb. 12, 2025. Available: https://global.rakuten.com/corp/news/press/2025/0212_02.html
9. “2025 LLM Technical Review: Performance and Applications,” *Shakudo Blog*, 2025. Available: https://www.shakudo.io/blog/top-9-large-language-models
4. “DeepSeek Architecture and Cost Analysis,” *TechTarget*, 2025. Available: https://www.techtarget.com/whatis/feature/DeepSeek-explained-Everything-you-need-to-know
2. “2025 AI Regulation Forecast,” *National Law Review*, 2025. Available: https://natlawreview.com/article/what-expect-2025-ai-legal-tech-and-regulation-65-expert-predictions

---
,*Prepared by the LLM Research Bulletin editorial team. For inquiries, contact research@llm-bulletin.ai.*
#+end_example

You get the picture. Here, I had the overall goal of making a newsletter. To this end, I set up an "agent" to do internet search and prepare research notes that would in turn be used by a reasoning model to turn it into an academic style newsletter. This is a very simple version of this, and I note that if you really read the output, it is informative but not perfect. Further improvements could be made on the prompt, or adding additional agents to do more research, edit the report, check for errors, and so forth. But I'll leave additional layers of complexity as an exercise to the reader.

I'd like to show you one more thing you can do when you start thinking in terms of prompt scripting. And that is adding a code execution layer to these prompts. Below is a simple script where a LLM produces code that is in turn executed. The user sees just the execution.

#+begin_src sh :results output :exports both
source ~/.zshrc

cmd=$(chatbot "claude" "Please produce a shell command to give me today's date and time. Just produce the command. Do not produce anything else.")

echo "$cmd"
eval "$cmd"
#+end_src

#+RESULTS:
: date
: Sun Feb 16 10:05:20 CET 2025

In the case of shell scripting, you simply use the "eval" command to run any code passed into it as a string, which is what I can get the chatbot to do.

You can imagine that we could get the chatbot to produce much more complex commands for whichever language as part of a much more complex pipeline. Again, I'll leave that as an exercise to the reader, now that you have the toolkit to do so.

We will now move to the related topic of how to get these commands working in a literate programming environment.
* The literate programming environment
** R Markdown and Jupyter Notebooks
The spoiler alert upfront is that in order to use the new script in a literate programming environment, you just have to get it to execute shell scripts. In R Markdown, there is an option to run bash. Jupyter notebooks have [[https://github.com/dahn-zk/zsh-jupyter-kernel][options]] as well. One of the key things that I've had to do to get the literate programming environment to recognize the script, is in every code block where I run it, I have to source my zshrc file. Like this:

#+begin_src sh :results output :exports both
source ~/.zshrc
chatbot "gpt3" "What is 5 + 2?"
#+end_src

#+RESULTS:
: 5 + 2 equals 7.

Maybe you won't have this problem, but if you do, that is how you get around it.
