public/command_line_writeup.html
<div id="outline-container-org11e9db4" class="outline-2">
<h2 id="org11e9db4">Prompt scripting: the next level of prompt engineering</h2>
<div class="outline-text-2" id="text-org11e9db4">
<p>
Now that we are able to call chatbot and searchbot from the command line, we now have to talk about what is possible that otherwise cannot be done in the LLM UI/UX. Here is where knowing how to code (as opposed to knowing how to prompt LLMs to code) really comes in handy. Because to understand the next level of prompt engineering, you need to be able to think algorithmically.
</p>

<p>
What we can do now is what I call prompt scripting. This is where you write scripts (in whatever programming language) where the data structures are LLM agents, rather than just strings and ints, for example. In order to help you understand what I'm talking about, I'm going to go right into a simple example.
</p>

<p>
Below, we are going to use searchbot and chatbot in a simple manner. We are going to produce a prompt for searchbot. We are then going to feed the searchbot results and the original prompt directly into chatbot, which will then produce a report.
</p>

<div class="org-src-container">
<pre class="src src-sh"><span class="org-builtin">source</span> ~/.zshrc

<span class="org-variable-name">news</span>=$(searchbot <span class="org-string">"Please give me the lastest news around LLM developments. Focus on things that have happened as of February 1, 2025 and after. Use the most reputable sources possible."</span>)
<span class="org-variable-name">newsletter</span>=$(chatbot <span class="org-string">"deepseek"</span> <span class="org-string">"You are to produce a newsletter given the latest updates around LLM developments as of February 1, 2025. A researcher, perplexity, has compiled notes for you to use. You will take these as input and produce the newsletter. Make it academic in style. Include citations as you would an academic journal, both in the report with footnotes along with a citations section. Begin with an abstract that summarizes these developments. The research notes you will use, along with sources, is here: $news"</span>)

<span class="org-builtin">echo</span> <span class="org-string">"$newsletter"</span>
</pre>
</div>

<p>
You get the picture. Here, I had the overall goal of making a newsletter. To this end, I set up an "agent" to do internet search and prepare research notes that would in turn be used by a reasoning model to turn it into an academic style newsletter. This is a very simple version of this, and I note that if you really read the output, it is informative but not perfect. Further improvements could be made on the prompt, or adding additional agents to do more research, edit the report, check for errors, and so forth. But I'll leave additional layers of complexity as an exercise to the reader.
</p>

<p>
I'd like to show you one more thing you can do when you start thinking in terms of prompt scripting. And that is adding a code execution layer to these prompts. Below is a simple script where a LLM produces code that is in turn executed. The user sees just the execution.
</p>

<div class="org-src-container">
<pre class="src src-sh"><span class="org-builtin">source</span> ~/.zshrc

<span class="org-variable-name">cmd</span>=$(chatbot <span class="org-string">"claude"</span> <span class="org-string">"Please produce a shell command to give me today's date and time. Just produce the command. Do not produce anything else."</span>)

<span class="org-builtin">echo</span> <span class="org-string">"$cmd"</span>
<span class="org-builtin">eval</span> <span class="org-string">"$cmd"</span>
</pre>
</div>

<p>
In the case of shell scripting, you simply use the "eval" command to run any code passed into it as a string, which is what I can get the chatbot to do.
</p>

<p>
You can imagine that we could get the chatbot to produce much more complex commands for whichever language as part of a much more complex pipeline. Again, I'll leave that as an exercise to the reader, now that you have the toolkit to do so.
</p>

<p>
We will now move to the related topic of how to get these commands working in a literate programming environment.
</p>
</div>
</div>
<div id="outline-container-org4bd06d5" class="outline-2">
<h2 id="org4bd06d5">The literate programming environment</h2>
<div class="outline-text-2" id="text-org4bd06d5">
</div>
<div id="outline-container-org7eba3e5" class="outline-3">
<h3 id="org7eba3e5">R Markdown and Jupyter Notebooks</h3>
<div class="outline-text-3" id="text-org7eba3e5">
<p>
The spoiler alert upfront is that in order to use the new script in a literate programming environment, you just have to get it to execute shell scripts. In R Markdown, there is an option to run bash. Jupyter notebooks have <a href="https://github.com/dahn-zk/zsh-jupyter-kernel">options</a> as well. One of the key things that I've had to do to get the literate programming environment to recognize the script, is in every code block where I run it, I have to source my zshrc file. Like this:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span class="org-builtin">source</span> ~/.zshrc
chatbot <span class="org-string">"gpt3"</span> <span class="org-string">"What is 5 + 2?"</span>
</pre>
</div>

<pre class="example">
5 + 2 equals 7.
</pre>


<p>
Maybe you won't have this problem, but if you do, that is how you get around it.
</p>
</div>
</div>
