public/command_line_writeup.html
<div id="outline-container-orgd76b774" class="outline-3">
<h3 id="orgd76b774">Emacs Org-Mode</h3>
<div class="outline-text-3" id="text-orgd76b774">
<p>
Now this section is for Emacs users who use org mode. This is the literate programming environment that I prefer, and I am writing this article directly in it. I am specifically using <a href="https://orgmode.org/worg/org-contrib/babel/">Babel</a> which allows for active code use in Org. This comes with Doom Emacs (I'm currently using this) and Spacemacs (I started with this).
</p>

<p>
The way you start a shell block here is by doing "<code>#+begin_src sh :results output</code>" and then another line underneath the code "<code>#+end_src</code>." There is a keybinding that shortcuts this. Just go to a new line and type "&lt;s + Tab." You'll see why this is important in a minute.
</p>

<p>
So go ahead and test this out on your computer and then we'll move to the next bit, where we make a keybinding specific to the making and use of our chatbot script.
</p>

<p>
Now what I have set up is a keybinding that sets up specifically this:
</p>

<p>
<code>#+begin_src sh :results output</code><br />
source ~/.zshrc<br />
chatbot "claude" "test"<br />
</p>

<p>
<code>#+end_src</code>
</p>

<p>
I can get the above block by typing "&lt;chat + Tab" anywhere I'd otherwise insert a code block within an Org file.
</p>

<p>
Anyway the way you set up this keyboard shortcut, at least in Doom emacs, is by going into your config file (config.el) within your .doom.d directory, going into your "after 'org" block, and adding the following lines.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span class="org-keyword">require</span> '<span class="org-constant">org-tempo</span>)
(add-to-list 'org-structure-template-alist
        '(<span class="org-string">"chat"</span> . <span class="org-string">"src sh :results output\nsource ~/.zshrc\nchatbot \"claude\" \"test\""</span>))
</pre>
</div>

<p>
You'll see that there is an unnecessary line that sits between the chatbot call and <code>end_src</code>. I have not yet figured out how to remove that line, but the text cursor automatically sits at that line, so you just have to press delete right after the block has been made and the line goes away. So really just think of it as "&lt;chat + Tab + Delete."
</p>
</div>
</div>
</div>
<div id="outline-container-orgeaf1952" class="outline-2">
<h2 id="orgeaf1952">Discussion</h2>
<div class="outline-text-2" id="text-orgeaf1952">
<p>
Since I made this command line cool and figured how to use it in a literate programming context, it has increased my productivity especially in the contexts of my German learning (I am American living in Berlin), and my research work. The more general theme is that I write prolifically in my literate programming environment (Org-Mode), and now I can get direct feedback from LLMs directly within this environment.
</p>

<p>
In general, I <a href="https://www.paulgraham.com/words.html">write to think</a>. Thus, now I can think and get real time feedback on my thoughts by LLMs that are becoming increasingly better, and are hallucinating less often. I have seen the occasional comment about how LLMs are going to reduce our ability to think about stuff, because we will end up <a href="https://hackernoon.com/the-stanford-grad-who-forgot-how-to-think">outsourcing our cognition</a> to them. My general goal is to use LLMs as a way to help me think more effectively about stuff, because being good a thinking about stuff is a core value of mine.
</p>

<p>
This is similar to bench pressing by myself versus with a spotter. As opposed to getting a spotter to do the bench pressing for me while I sit back and watch. That is a sort of litmus test for my LLM use: does it increase brain activity or <a href="https://paulgraham.com/writes.html">decrease it</a>? If my brain activity goes up or at least stays the same, then I will consider it a valid use case for me. If my brain activity goes down, then that is not a valid use case for me.
</p>

<p>
Adding the capability to have API access to internet-searching LLMs, which is what Bing Chat (aka <a href="https://www.lesswrong.com/posts/jtoPawEhLNXNxvgTT/bing-chat-is-blatantly-aggressively-misaligned">Sydney</a>) originally did, makes it possible to have even more complexity in your LLM use. The example I used was that of having an internet search agent act produce research notes on a topic and then to have a reasoning-based agent convert that into a newsletter. Given new tools like OpenAI's <a href="https://openai.com/index/introducing-deep-research/">Deep Research</a> out there, I know that all of this this might seem a bit like reinventing the wheel, but one of the things that I want to do is understand how these things work under the hood. And one way to understand how something works is to <a href="https://www.youtube.com/watch?v=kCc8FmEb1nY">build it yourself</a>.
</p>

<p>
Finally, the bigger picture here is that there is a level above prompt engineering that I'm calling prompt scripting, where you start to think less in terms of prompts to LLMs and rather in terms of flow charts where each nodes is a LLM that has a different function and pre-prompt, passing output into other LLMs as input. This can allow for much you to achieve much more complex goals than that of a simple prompt. I gave a simple example of a 2-agent prompt script that produces a newsletter, and another example of an agent that produces a shell command that then gets directly executed. Think of these are simplest legos, from which you can build all kinds of complex things, the way you can build <a href="https://www.nand2tetris.org/">Tetris</a> from <a href="https://tjburns08.github.io/logic_gates.html">NAND gates</a>.
</p>

<p>
In short, having a LLM in a literate programming environment has done me some good, and I hope it will do some of you some good too. Give this a shot if only for the exercise of knowing how to do it. It's nice to be independent of the interfaces, and it's a "gateway drug" into building your own apps.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: January 24, 2025 - February 16, 2025</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.1 (<a href="https://orgmode.org">Org</a> mode 9.5.2)</p>
</div>
</body>
</html>
